---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.MaterialAspaint
source: html/554ffe01-163c-946d-8fa9-98968eabc03b.htm
---
# Autodesk.Revit.DB.ParameterTypeId.MaterialAspaint Property

"As Paint"

## Syntax (C#)
```csharp
public static ForgeTypeId MaterialAspaint { get; }
```